---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.JoinElementsFailures.CannotKeepWallJoinToRoofError
source: html/c2a2b564-9afc-1bed-487c-fb1395db8a29.htm
---
# Autodesk.Revit.DB.BuiltInFailures.JoinElementsFailures.CannotKeepWallJoinToRoofError Property

Can't keep wall and [target] joined

## Syntax (C#)
```csharp
public static FailureDefinitionId CannotKeepWallJoinToRoofError { get; }
```